def distance(x1, y1, x2, y2):
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5

x1, y1 = int(input('Введите координату Х начала отрезка')), int(input('Введите координату Y начала отрезка'))
x2, y2 = int(input('Введите координату Х конца отрезка')), int(input('Введите координату Y конца отрезка'))
a_b = distance(x1, y1, x2, y2)
x1, y1 = int(input('Введите координату Х начала отрезка')), int(input('Введите координату Y начала отрезка'))
x2, y2 = int(input('Введите координату Х конца отрезка')), int(input('Введите координату Y конца отрезка'))
a_c = distance(x1, y1, x2, y2)
x1, y1 = int(input('Введите координату Х начала отрезка')), int(input('Введите координату Y начала отрезка'))
x2, y2 = int(input('Введите координату Х конца отрезка')), int(input('Введите координату Y конца отрезка'))
b_c = distance(x1, y1, x2, y2)
print("Самый короткий отрезок:", '%.2f' % (min([a_b, a_c, b_c]))) 
